$(document).ready(function() {
  // Завдання з селекторами
  // Виберіть всі елементи <p> та змініть їхній текст на "Змінений текст".
  $('p').text('Змінений текст');

  // Виберіть елемент з ідентифікатором task1 та додайте йому клас highlight.
  $('#task1').addClass('highlight');

  // Виберіть всі елементи <li> та додайте їм клас list-item.
  $('li').addClass('list-item');

  // Завдання зі змінами стилів
  // Змініть колір тексту всіх елементів з класом highlight на червоний.
  $('.highlight').css('color', 'red');

  // Змініть фон всіх елементів з класом list-item на червоний.
  $('.list-item').css('background-color', 'lightgray');

  // Завдання з анімацією
  // Зробіть анімаційний ефект для елементів з класом highlight (наприклад, fadeIn або slideDown).
  $('.highlight').fadeIn(2000); // Змініть 2000 на бажаний час анімації в мілісекундах.

  // Завдання на зміну вмісту
  // Змініть текст останнього елемента <p> у блоку з ідентифікатором task1 на "Новий останній текст".
  $('#task1 p:last-child').text('Новий останній текст');

  // Додаткове завдання
  // Створіть кнопку на сторінці
  // Додайте обробник подій для цієї кнопки, який буде видаляти всі елементи з класом list-item.
  $('#removeButton').on('click', function() {
    $('.list-item').remove();
  });
});